{
  "featuredProjects": [
    {
      "title": "Pokédexle",
      "imageSrc": "/pokedexle.png",
      "githubUrl": "https://github.com/Addison-Dalton/pokedexle",
      "projectUrl": "https://pokedexle.app",
      "description": "Pokédexle is a Pokémon guessing game. Like many, I was caught up in the Wordle craze of early 2022. I was also playing Pokémon Arceus at the time. The idea hit me that Pokémon would be a perfect adaptation, and thus Pokédexle was born.",
      "techs": [
        "React",
        "Chakra UI",
        "Redux Toolkit",
        "PokeAPI",
        "Fuse.js"
      ]
    },
    {
      "title": "Tidbyt Solar Display",
      "imageSrc": "/sma-inverter-server.png",
      "githubUrl": "https://github.com/Addison-Dalton/sma-inverter-server",
      "description": "This is a pixlet app built for my Tidbyt to display the current power generated by my solar panels. It involves an Express server that communicates with SMA solar inverters. The pixlet app makes API calls to the Express server to get the current power generation. Docker is used to easily containerize and handle the start-up process for both services.",
      "techs": [
        "Express",
        "Pixlet",
        "Docker",
        "Cron"
      ]
    },
    {
      "title": "Enigma Machine",
      "imageSrc": "/enigma-machine.png",
      "githubUrl": "https://github.com/Addison-Dalton/engima-machine",
      "projectUrl": "https://addison-dalton.github.io/engima-machine/",
      "description": "The Enigma machine is a simulation that emulates the operations of the renowned Enigma machine used during World War II. Users can input messages, configure rotor settings, and witness real-time transformations, providing an interactive and educational experience.",
      "techs": [
        "React",
        "Redux Toolkit",
        "styled-components",
        "TypeScript"
      ]
    },
    {
      "title": "Civilization VI Mod",
      "imageSrc": "/civ6-healing-engineers.png",
      "githubUrl": "https://github.com/Addison-Dalton/Civ6-Engineers-Heal-Mechanized-Units",
      "projectUrl": "https://steamcommunity.com/sharedfiles/filedetails/?id=2200107167",
      "description": "This is a mod for the popular turn-based strategy game, Civilization VI. The mod augments the Engineer unit to allow them to heal nearby mechanized units. The mod is available on the Steam workshop.",
      "techs": [
        "TSQL",
        "Steam Workshop"
      ]
    },
    {
      "title": "JavaScript Tic-Tac-Toe",
      "imageSrc": "/tic-tac-toe.png",
      "githubUrl": "https://github.com/Addison-Dalton/tic-tac-toe-game",
      "projectUrl": "https://codepen.io/addisondalton/full/WRVLZa",
      "description": "This was one of my first web development projects. It's a simple HTML, CSS, and JS app in which you play tic-tac-toe against the computer. The app allows players to choose between \"X\" and \"O\", and keeps track of score across matches.",
      "techs": [
        "JavaScript",
        "HTML",
        "CSS"
      ]
    },
    {
      "title": "Teatime",
      "imageSrc": "/tea-time.png",
      "githubUrl": "https://github.com/Addison-Dalton/teatime",
      "description": "Teatime is a simple Android app I made many years ago. It allowed you to select from a list of teas, and would provide optimal temperature and brew time for that tea. In addition to this, it could act as a timer to alert you when your tea is done brewing.",
      "techs": [
        "Java",
        "Gradle",
        "Android Studio"
      ]
    }
  ],
  "otherProjects": [
    {
      "title": "Pixel paint",
      "description": "This was made for a Game Jam. It was an attempt at a React based pixel editor. For now it renders a simple grid of pixels with the ability to fill them in with a color.",
      "githubUrl": "https://github.com/Addison-Dalton/pixel-paint",
      "techs": [
        "React",
        "Chakra UI",
        "Redux Toolkit"
      ]
    },
    {
      "title": "Wordle Solver Chrome Extension",
      "description": "This was a chrome extension that provides a top 5 list of suggested words while playing Wordle. It would update as words were guessed.",
      "githubUrl": "https://github.com/Addison-Dalton/wordle-solver-chrome",
      "techs": [
        "React",
        "TypeScript"
      ]
    },
    {
      "title": "Contra-bot",
      "description": "A discord bot that would reply with chat, and audio, phrases from the YouTuber Contrapoints. Users could configure the bot to play certain sound bites upon entering and leaving voice chat. I hosted the bot locally using Docker.",
      "githubUrl": "https://github.com/Addison-Dalton/contra-bot",
      "techs": [
        "TypeScript",
        "Discord Bot",
        "Docker"
      ]
    },
    {
      "title": "Hex map",
      "description": "A Unity \"game\" that was intended to be a simple Civilization-like clone. For now it only generates a hex map of tiles.",
      "githubUrl": "https://github.com/Addison-Dalton/hex-map",
      "techs": [
        "Unity",
        "C#"
      ]
    },
    {
      "title": "Solar System Simulation",
      "description": "This was my capstone CS project in college. It was a simulated solar system in which users could add, remove, and move various plants and other celestial bodies. All the planets would interact with one another's gravitional fields.",
      "githubUrl": "https://github.com/Addison-Dalton/SolarSystemSimulationProject",
      "techs": [
        "C++"
      ]
    },
    {
      "title": "RSA Encryption",
      "description": "This was my capstone Math project in college. It demonstrated RSA encryption by providing users the ability to encrypt and decrypt messages. It also provided information on how the RSA encryption process works.",
      "githubUrl": "https://github.com/Addison-Dalton/RSAEncryption",
      "techs": [
        "C#"
      ]
    }
  ]
}